/*
 Navicat Premium Data Transfer

 Source Server         : localhost
 Source Server Type    : MySQL
 Source Server Version : 100122
 Source Host           : localhost:3306
 Source Schema         : 1062XML

 Target Server Type    : MySQL
 Target Server Version : 100122
 File Encoding         : 65001

 Date: 19/06/2018 10:18:14
*/

SET NAMES utf8mb4;
SET FOREIGN_KEY_CHECKS = 0;

-- ----------------------------
-- Table structure for station
-- ----------------------------
DROP TABLE IF EXISTS `station`;
CREATE TABLE `station` (
  `ID` varchar(5) NOT NULL DEFAULT '',
  `TimeID` varchar(5) DEFAULT NULL,
  `StationName` varchar(10) DEFAULT NULL,
  `lat` varchar(20) DEFAULT NULL,
  `lng` varchar(20) DEFAULT NULL,
  `branch` varchar(10) DEFAULT NULL,
  `address` varchar(40) DEFAULT NULL,
  `tel` varchar(15) DEFAULT NULL,
  `city` varchar(5) DEFAULT NULL,
  PRIMARY KEY (`ID`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of station
-- ----------------------------
BEGIN;
INSERT INTO `station` VALUES ('10', '1628', '瑞和站', '22.979985', '121.15584', '', '臺東縣鹿野鄉瑞和村瑞榮路1之1號', '無', '臺東縣');
INSERT INTO `station` VALUES ('100', '1008', '臺北站', '25.0479239', '121.517081', '', '臺北市中正區黎明里北平西路3號', '02-23713558、02-', '臺北市');
INSERT INTO `station` VALUES ('101', '1009', '萬華站', '25.0333965', '121.5004388', '', '臺北市萬華區富福里康定路382號', '02-23020481', '臺北市');
INSERT INTO `station` VALUES ('102', '1011', '板橋站', '25.0140513', '121.463815', '', '新北市板橋區縣民大道2段7號', '02-89691036', '新北市');
INSERT INTO `station` VALUES ('103', '1012', '樹林站', '24.9914074', '121.4246008', '', '新北市樹林區樹北里鎮前街112號', '02-26812052', '新北市');
INSERT INTO `station` VALUES ('104', '1013', '山佳站', '24.9724808', '121.392614', '', '新北市樹林區中山里中山路3段108號', '02-26808874', '新北市');
INSERT INTO `station` VALUES ('105', '1014', '鶯歌站', '24.95462', '121.356026', '', '新北市鶯歌區東鶯里文化路68-1號', '02-26792004', '新北市');
INSERT INTO `station` VALUES ('106', '1015', '桃園站', '24.989206', '121.313549', '', '桃園市桃園區武陵里中正路1號', '03-3323304', '桃園市');
INSERT INTO `station` VALUES ('107', '1016', '內壢站', '24.9744782', '121.2633953', '', '桃園市中壢區中原里中華路1段267號', '03-4559725', '桃園市');
INSERT INTO `station` VALUES ('108', '1017', '中壢站', '24.9534545', '121.2257365', '', '桃園市中壢區石頭里中和路139號', '03-4223235', '桃園市');
INSERT INTO `station` VALUES ('109', '1018', '埔心站', '24.9192082', '121.1838019', '', '桃園市楊梅區埔心里永美路208之1號', '03-4827100', '桃園市');
INSERT INTO `station` VALUES ('110', '1019', '楊梅站', '24.9108316', '121.1456848', '', '桃園市楊梅區楊梅里大成路256號', '03-4782893', '桃園市');
INSERT INTO `station` VALUES ('111', '1020', '富岡站', '24.9343559', '121.0815085', '', '桃園市楊梅區富岡里成功路37號', '03-4723754', '桃園市');
INSERT INTO `station` VALUES ('112', '1021', '湖口站', '24.9028648', '121.0441227', '', '新竹縣湖口鄉仁勢村中山路2段121號', '03-5992192', '新竹縣');
INSERT INTO `station` VALUES ('113', '1022', '新豐站', '24.8699365', '120.9965875', '', '新竹縣新豐鄉員山村新興路202號', '03-5596314', '新竹縣');
INSERT INTO `station` VALUES ('114', '1023', '竹北站', '24.8391207', '121.0095335', '', '新竹縣竹北市福德里和平街59號', '03-5552024', '新竹縣');
INSERT INTO `station` VALUES ('115', '1025', '新竹站', '24.8016432', '120.9716955', '', '新竹市榮光里中華路2段445號', '03-5237441', '新竹市');
INSERT INTO `station` VALUES ('116', '1026', '香山站', '24.7631278', '120.9138744', '', '新竹市朝山里中華路5段347巷2弄27號', '無', '新竹市');
INSERT INTO `station` VALUES ('117', '1027', '崎頂站', '24.7228788', '120.8718921', '', '苗栗縣竹南鎮崎頂里北戶55號', '無', '苗栗縣');
INSERT INTO `station` VALUES ('118', '1028', '竹南站', '24.6866106', '120.8806984', '', '苗栗縣竹南鎮中山路166號', '037-472030', '苗栗縣');
INSERT INTO `station` VALUES ('119', '1102', '談文站', '24.6564147', '120.8582416', '海', '苗栗縣造橋鄉談文村仁愛路29號', '無', '苗栗縣');
INSERT INTO `station` VALUES ('12', '1626', '關山站', '23.0456654', '121.164373', '', '臺東縣關山鎮博愛路2號', '089-811033', '臺東縣');
INSERT INTO `station` VALUES ('120', '1104', '大山站', '24.645645', '120.803778', '海', '苗栗縣後龍鎮大山里明山路180號', '無', '苗栗縣');
INSERT INTO `station` VALUES ('121', '1105', '後龍站', '24.6162121', '120.7873071', '海', '苗栗縣後龍鎮南龍里車站街127號', '037-728616', '苗栗縣');
INSERT INTO `station` VALUES ('122', '1106', '龍港站', '24.611683', '120.758142', '海', '苗栗縣後龍鎮龍京里7鄰公司寮85號', '無', '苗栗縣');
INSERT INTO `station` VALUES ('123', '1107', '白沙屯站', '24.564797', '120.7081978', '海', '苗栗縣通霄鎮白西里131號', '037-793066', '苗栗縣');
INSERT INTO `station` VALUES ('124', '1108', '新埔站', '24.54018', '120.695179', '海', '苗栗縣通霄鎮新埔里8鄰57號', '無', '苗栗縣');
INSERT INTO `station` VALUES ('125', '1109', '通霄站', '24.4914035', '120.6784246', '海', '苗栗縣通霄鎮通西里中山路109號', '037-758300', '苗栗縣');
INSERT INTO `station` VALUES ('126', '1110', '苑裡站', '24.443426', '120.651494', '海', '苗栗縣苑裡鎮中山路165號', '037-851013', '苗栗縣');
INSERT INTO `station` VALUES ('127', '1111', '日南站', '24.3780659', '120.6541189', '海', '臺中市大甲區孟春里中山路2段140巷8號', '無', '臺中市');
INSERT INTO `station` VALUES ('128', '1112', '大甲站', '24.34443', '120.6270172', '海', '臺中市大甲區中山路1段828號', '04-26872022', '臺中市');
INSERT INTO `station` VALUES ('129', '1113', '臺中港站', '24.304388', '120.602303', '海', '臺中市清水區甲南路2號', '04-26225374', '臺中市');
INSERT INTO `station` VALUES ('130', '1114', '清水站', '24.2636239', '120.569178', '海', '臺中市清水區南社里中正街115號', '04-26222021', '臺中市');
INSERT INTO `station` VALUES ('131', '1115', '沙鹿站', '24.2370445', '120.5576269', '海', '臺中市沙鹿區中正街94號', '04-26625057', '臺中市');
INSERT INTO `station` VALUES ('132', '1116', '龍井站', '24.1972272', '120.5443041', '海', '臺中市龍井區龍新路1號', '04-26355578', '臺中市');
INSERT INTO `station` VALUES ('133', '1117', '大肚站', '24.1550185', '120.5425336', '海', '臺中市大肚區平和街121號', '04-26992523', '臺中市');
INSERT INTO `station` VALUES ('134', '1118', '追分站', '24.1208194', '120.5695894', '海', '臺中市大肚區王田里追分街13號', '04-26933106', '臺中市');
INSERT INTO `station` VALUES ('135', '1302', '造橋站', '24.6418626', '120.867194', '山', '苗栗縣造橋鄉造橋村平仁路54號', '無', '苗栗縣');
INSERT INTO `station` VALUES ('136', '1304', '豐富站', '24.6011288', '120.8235487', '山', '苗栗縣後龍鎮新港路116號', '無', '苗栗縣');
INSERT INTO `station` VALUES ('137', '1305', '苗栗站', '24.5700216', '120.8225292', '山', '苗栗縣苗栗市為公路1號', '037-260031', '苗栗縣');
INSERT INTO `station` VALUES ('138', '1307', '南勢站', '24.522753', '120.793193', '山', '苗栗縣苗栗市新英里南勢39號', '無', '苗栗縣');
INSERT INTO `station` VALUES ('139', '1308', '銅鑼站', '24.4863398', '120.7861726', '山', '苗栗縣銅鑼鄉銅鑼村大同路13號', '037-983838', '苗栗縣');
INSERT INTO `station` VALUES ('14', '1625', '海端站', '23.1029344', '121.1768294', '', '臺東縣關山鎮西莊49號', '無', '臺東縣');
INSERT INTO `station` VALUES ('140', '1310', '三義站', '24.4206203', '120.7739306', '山', '苗栗縣三義鄉雙湖村90號', '037-874763', '苗栗縣');
INSERT INTO `station` VALUES ('142', '1314', '泰安站', '24.331292', '120.741816', '山', '臺中巿后里區安眉路37-12號', '無', '臺中巿');
INSERT INTO `station` VALUES ('143', '1315', '后里站', '24.309312', '120.732893', '山', '臺中市后里區甲后路1號', '04-25562038', '臺中市');
INSERT INTO `station` VALUES ('144', '1317', '豐原站', '24.254112', '120.722917', '山', '臺中市豐原區中正路1號', '04-25207950', '臺中市');
INSERT INTO `station` VALUES ('145', '1318', '潭子站', '24.2132325', '120.7053569', '山', '臺中市潭子區中山路二段352號', '04-25319200', '臺中市');
INSERT INTO `station` VALUES ('146', '1319', '臺中站', '24.136781', '120.685008', '山', '臺中市建國路172號', '04-22227236', '臺中市');
INSERT INTO `station` VALUES ('147', '1320', '烏日站', '24.1086923', '120.6224719', '山', '臺中市烏日區三民街258號', '04-23381071', '臺中市');
INSERT INTO `station` VALUES ('148', '1321', '成功站', '24.1107677', '120.6004956', '山', '臺中市烏日區中山路3段550號', '04-23371986', '臺中市');
INSERT INTO `station` VALUES ('149', '1120', '彰化站', '24.0816657', '120.5385394', '', '彰化縣彰化市三民路1號', '04-7278263', '彰化縣');
INSERT INTO `station` VALUES ('15', '1624', '池上站', '23.1261582', '121.2193902', '', '臺東縣池上鄉鐵花路30號', '089-862097', '臺東縣');
INSERT INTO `station` VALUES ('150', '1202', '花壇站', '24.0249965', '120.5373997', '', '彰化縣花壇鄉中正路370號', '無', '彰化縣');
INSERT INTO `station` VALUES ('151', '1203', '員林站', '23.9593465', '120.5699606', '', '彰化縣員林鎮民權街55號', '04-8320544', '彰化縣');
INSERT INTO `station` VALUES ('152', '1204', '永靖站', '23.9281475', '120.5716724', '', '彰化縣永靖鄉崙子村永崙路25號', '無', '彰化縣');
INSERT INTO `station` VALUES ('153', '1205', '社頭站', '23.8957104', '120.5808001', '', '彰化縣社頭鄉廣興村社站路10號', '04-8711646', '彰化縣');
INSERT INTO `station` VALUES ('154', '1206', '田中站', '23.857685', '120.583564', '', '彰化縣田中鎮中州路1段1號', '04-8742142', '彰化縣');
INSERT INTO `station` VALUES ('155', '1207', '二水站', '23.8131501', '120.618115', '', '彰化縣二水鄉光文路1號', '04-8792027', '彰化縣');
INSERT INTO `station` VALUES ('156', '1208', '林內站', '23.7596808', '120.614987', '', '雲林縣林內鄉中山路42號', '05-5892040', '雲林縣');
INSERT INTO `station` VALUES ('157', '1209', '石榴站', '23.725819', '120.577977', '', '雲林縣斗六市榴北里文明路26號', '無', '雲林縣');
INSERT INTO `station` VALUES ('158', '1210', '斗六站', '23.7124606', '120.54327', '', '雲林縣斗六市信義里民生路187號', '05-5332900', '雲林縣');
INSERT INTO `station` VALUES ('159', '1211', '斗南站', '23.6729716', '120.4808407', '', '雲林縣斗南鎮南昌里中山路2號', '05-5972039', '雲林縣');
INSERT INTO `station` VALUES ('160', '1212', '石龜站', '23.6386539', '120.4732056', '', '雲林縣斗南鎮石溪里', '無', '雲林縣');
INSERT INTO `station` VALUES ('161', '1213', '大林站', '23.6010764', '120.4558391', '', '嘉義縣大林鎮吉林里中山路2號', '05-2654804', '嘉義縣');
INSERT INTO `station` VALUES ('162', '1214', '民雄站', '23.5550395', '120.4316513', '', '嘉義縣民雄鄉東榮村和平路2號', '05-2264272', '嘉義縣');
INSERT INTO `station` VALUES ('163', '1215', '嘉義站', '23.4793059', '120.4422923', '', '嘉義市中山路528號(含前、後站)', '05-2228904', '嘉義市');
INSERT INTO `station` VALUES ('164', '1217', '水上站', '23.433976', '120.399706', '', '嘉義縣水上鄉粗溪村68號', '無', '嘉義縣');
INSERT INTO `station` VALUES ('165', '1218', '南靖站', '23.406972', '120.3853425', '', '嘉義縣水上鄉三鎮村26號', '無', '嘉義縣');
INSERT INTO `station` VALUES ('166', '1219', '後壁站', '23.366247', '120.360603', '', '臺南市後壁區後壁里77號', '', '臺南市');
INSERT INTO `station` VALUES ('167', '1220', '新營站', '23.3067319', '120.323055', '', '臺南市新營區中營里中山路1號', '06-6322104', '臺南市');
INSERT INTO `station` VALUES ('168', '1221', '柳營站', '23.27762', '120.322519', '', '臺南市柳營區東昇里建國路1號', '', '臺南市');
INSERT INTO `station` VALUES ('169', '1222', '林鳳營站', '23.242592', '120.320973', '', '臺南市六甲區中社里林鳳營16號', '06-6986086', '臺南市');
INSERT INTO `station` VALUES ('170', '1223', '隆田站', '23.1926666', '120.318898', '', '臺南市官田區隆田里中山路1段1號', '06-5791664', '臺南市');
INSERT INTO `station` VALUES ('171', '1224', '拔林站', '23.172291', '120.321185', '', '臺南市官田區拔林里83之1號', '無', '臺南市');
INSERT INTO `station` VALUES ('172', '1225', '善化站', '23.1333235', '120.3065509', '', '臺南市善化區中山路1號', '06-5837301', '臺南市');
INSERT INTO `station` VALUES ('173', '1226', '新市站', '23.0643755', '120.2944406', '', '臺南市新市區新和里中華路1號', '06-5996911', '臺南市');
INSERT INTO `station` VALUES ('174', '1227', '永康站', '23.0383377', '120.2535236', '', '臺南市永康區埔園里中山路459號', '06-2323305', '臺南市');
INSERT INTO `station` VALUES ('175', '1228', '臺南站', '22.9971443', '120.2129662', '', '臺南市東區北門路2段4號', '06-2261314', '臺南市');
INSERT INTO `station` VALUES ('176', '1229', '保安站', '22.9329397', '120.2315935', '', '臺南市仁德區保安里文賢路1段529巷10號', '06-2665988', '臺南市');
INSERT INTO `station` VALUES ('177', '1230', '中洲站', '22.909584', '120.249932', '', '臺南市仁德區中洲路298之1號', '06-2667191', '臺南市');
INSERT INTO `station` VALUES ('178', '1231', '大湖站', '22.8802741', '120.2533872', '', '高雄市路竹區甲南里天佑路24號', '07-6932127', '高雄市');
INSERT INTO `station` VALUES ('179', '1232', '路竹站', '22.8547588', '120.265653', '', '高雄市路竹區竹南里中正路288號', '07-6072723', '高雄市');
INSERT INTO `station` VALUES ('18', '1623', '富里站', '23.1791319', '121.2486917', '', '花蓮縣富里鄉車站街56號', '03-8831771', '花蓮縣');
INSERT INTO `station` VALUES ('180', '1233', '岡山站', '22.7922708', '120.3000191', '', '高雄市岡山區岡燕路111號', '07-6212074', '高雄市');
INSERT INTO `station` VALUES ('181', '1234', '橋頭站', '22.7599698', '120.3105702', '', '高雄市橋頭區橋頭里站前街14號', '07-6115424', '高雄市');
INSERT INTO `station` VALUES ('183', '1235', '楠梓站', '22.7270354', '120.3243707', '', '高雄市楠梓區建楠路229號', '07-3510175', '高雄市');
INSERT INTO `station` VALUES ('184', '1236', '左營站', '22.675204', '120.2947934', '', '高雄市左營區勝利路1號', '無', '高雄市');
INSERT INTO `station` VALUES ('185', '1238', '高雄站', '22.6396198', '120.3021106', '', '高雄市三民區建國二路318號', '07-2352376', '高雄市');
INSERT INTO `station` VALUES ('186', '1402', '鳳山站', '22.631284', '120.357683', '', '高雄市鳳山區曹公路70號', '07-7460423', '高雄市');
INSERT INTO `station` VALUES ('187', '1403', '後庄站', '22.6400667', '120.3911254', '', '高雄市大寮區民慶街9號', '07-7020149', '高雄市');
INSERT INTO `station` VALUES ('188', '1404', '九曲堂站', '22.6595711', '120.4213296', '', '高雄市大樹區久堂里鐵路巷15號', '07-6512020', '高雄市');
INSERT INTO `station` VALUES ('189', '1405', '六塊厝站', '22.665987', '120.464996', '', '屏東縣屏東市長安里光復路392號', '無', '屏東縣');
INSERT INTO `station` VALUES ('190', '1406', '屏東站', '22.669306', '120.486203', '', '屏東縣屏東市光復路43號', '08-7655240', '屏東縣');
INSERT INTO `station` VALUES ('191', '1407', '歸來站', '22.652189', '120.502952', '', '屏東縣屏東市歸來里歸仁路5-4號', '無', '屏東縣');
INSERT INTO `station` VALUES ('192', '1408', '麟洛站', '22.634819', '120.514368', '', '屏東縣麟洛鄉田道村緀仔一路', '無', '屏東縣');
INSERT INTO `station` VALUES ('193', '1409', '西勢站', '22.616433', '120.5266971', '', '屏東縣竹田鄉西勢村西豐路2號', '08-7784521', '屏東縣');
INSERT INTO `station` VALUES ('194', '1410', '竹田站', '22.5864608', '120.5418585', '', '屏東縣竹田鄉履豐村豐明路27-1號', '08-7711002', '屏東縣');
INSERT INTO `station` VALUES ('195', '1411', '潮州站', '22.550086', '120.53642', '', '屏東縣潮州鎮信義路111號', '08-7882739', '屏東縣');
INSERT INTO `station` VALUES ('196', '1412', '崁頂站', '22.512921', '120.511117', '', '屏東縣崁頂鄉崁頂村中正路122號', '無', '屏東縣');
INSERT INTO `station` VALUES ('197', '1413', '南州站', '22.4920584', '120.5117382', '', '屏東縣南州鄉仁里村仁里路86號', '08-8642942', '屏東縣');
INSERT INTO `station` VALUES ('198', '1414', '鎮安站', '22.457927', '120.511321', '', '屏東縣林邊鄉鎮安村永和路4號', '無', '屏東縣');
INSERT INTO `station` VALUES ('199', '1415', '林邊站', '22.4314061', '120.5153762', '', '屏東縣林邊鄉仁和村仁愛路33號', '08-8751475', '屏東縣');
INSERT INTO `station` VALUES ('20', '1622', '東竹站', '23.226025', '121.278481', '', '花蓮縣富里鄉新興村26號', '03-8821504', '花蓮縣');
INSERT INTO `station` VALUES ('200', '1416', '佳冬站', '22.4140869', '120.5477418', '', '屏東縣佳冬鄉六根村復興路21號', '08-8662939', '屏東縣');
INSERT INTO `station` VALUES ('201', '1417', '東海站', '22.398968', '120.572356', '', '屏東縣枋寮鄉東海村西安路92號', '無', '屏東縣');
INSERT INTO `station` VALUES ('203', '1418', '枋寮站', '22.3680186', '120.5950975', '', '屏東縣枋寮鄉枋寮村儲運路18號', '08-8782041', '屏東縣');
INSERT INTO `station` VALUES ('204', '1502', '加祿站', '22.330971', '120.624621', '', '屏東縣枋山鄉加祿村會社路53號', '08-8720791', '屏東縣');
INSERT INTO `station` VALUES ('205', '1503', '內獅站', '22.297838', '120.643774', '', '屏東縣枋山鄉加祿村南和路43號', '08-8720791', '屏東縣');
INSERT INTO `station` VALUES ('206', '1504', '枋山站', '22.267067', '120.659647', '', '屏東縣獅子鄉內獅村內獅巷84號', '08-8720791', '屏東縣');
INSERT INTO `station` VALUES ('210', '1507', '古莊站', '22.3455088', '120.8780786', '', '臺東縣大武鄉尚武村古莊83號', '089-791820', '臺東縣');
INSERT INTO `station` VALUES ('211', '1508', '大武站', '22.365217', '120.9008', '', '臺東縣大武鄉大鳥村和平部落33號', '089-792056', '臺東縣');
INSERT INTO `station` VALUES ('213', '1510', '瀧溪站', '22.463806', '120.938037', '', '臺東縣太麻里鄉多良村大溪14鄰37之1號', '089-761482', '臺東縣');
INSERT INTO `station` VALUES ('215', '1512', '金崙站', '22.531488', '120.9672394', '', '臺東縣太麻里鄉金崙村47-17號', '089-771068', '臺東縣');
INSERT INTO `station` VALUES ('217', '1514', '太麻里站', '22.618823', '121.005007', '', '臺東縣太麻里鄉大王村276-13號', '089-781544', '臺東縣');
INSERT INTO `station` VALUES ('219', '1516', '知本站', '22.7314629', '121.0587551', '', '臺東縣臺東市知本路二段900巷85號', '089-514482', '臺東縣');
INSERT INTO `station` VALUES ('22', '1621', '東里站', '23.2723086', '121.3041814', '', '花蓮縣富里鄉大莊路15號之6', '03-8861005', '花蓮縣');
INSERT INTO `station` VALUES ('220', '1517', '康樂站', '22.7636935', '121.0941177', '', '臺東縣臺東市博物館路51巷131號', '089-383107', '臺東縣');
INSERT INTO `station` VALUES ('223', '1322', '大慶站', '24.118876', '120.647897', '山', '臺中市建國路80號(對面)', '無', '臺中市');
INSERT INTO `station` VALUES ('224', '1029', '三坑站', '25.1230089', '121.7418331', '', '基隆市仁愛區龍安街206號', '02-24230289', '基隆市');
INSERT INTO `station` VALUES ('225', '1323', '太原站', '24.1666822', '120.7000847', '山', '臺中市東光路833號', '無', '臺中市');
INSERT INTO `station` VALUES ('226', '1239', '大橋站', '23.0193991', '120.2244201', '', '臺南市永康區中華路835號', '06-3021755', '臺南市');
INSERT INTO `station` VALUES ('227', '1240', '大村站', '23.9900528', '120.5606453', '', '彰化縣大村鄉過溝村福進路100號', '無', '彰化縣');
INSERT INTO `station` VALUES ('228', '1241', '嘉北站', '23.500685', '120.451295', '', '嘉義市後湖里保健街110號', '05-2334584', '嘉義市');
INSERT INTO `station` VALUES ('231', '1903', '大華站', '25.049964', '121.797847', '平溪線', '新北市平溪區六分路12-1號', '無', '新北市');
INSERT INTO `station` VALUES ('232', '1904', '十分站', '25.0430998', '121.7767203', '平溪線', '新北市平溪區十分街51號', '02-24958307', '新北市');
INSERT INTO `station` VALUES ('233', '1905', '望古站', '25.0345984', '121.7537404', '平溪線', '新北市平溪區(無站房)', '無', '新北市');
INSERT INTO `station` VALUES ('234', '1906', '嶺腳站', '25.030052', '121.74804', '平溪線', '新北市平溪區嶺腳街22號', '無', '新北市');
INSERT INTO `station` VALUES ('235', '1907', '平溪站', '25.025789', '121.7410565', '平溪線', '新北市平溪區中華街12號', '無', '新北市');
INSERT INTO `station` VALUES ('236', '1908', '菁桐站', '25.0246184', '121.7284449', '平溪線', '新北市平溪區菁桐街52號', '無', '新北市');
INSERT INTO `station` VALUES ('237', '1024', '北新竹站', '24.808765', '120.9838244', '', '新竹市中華路1段291之2號', '無', '新竹市');
INSERT INTO `station` VALUES ('238', '2212', '千甲站', '24.8066257', '121.0033786', '內灣線', '新竹市水源里千甲路142號', '無', '新竹市');
INSERT INTO `station` VALUES ('239', '2213', '新莊站', '24.7880283', '121.0219477', '內灣線', '新竹市新莊里關東路310號', '無', '新竹市');
INSERT INTO `station` VALUES ('240', '2214', '六家站', '24.807528', '121.0393001', '六家線', '新竹縣竹北市復興三路2段229號', '無', '新竹縣');
INSERT INTO `station` VALUES ('241', '2203', '竹中站', '24.7814701', '121.030687', '內灣線', '新竹縣竹東鎮頭重里竹中路145號', '無', '新竹縣');
INSERT INTO `station` VALUES ('242', '2204', '上員站', '24.777831', '121.055699', '內灣線', '新竹縣竹東鎮上員里(無站房)', '無', '新竹縣');
INSERT INTO `station` VALUES ('243', '2205', '竹東站', '24.7378224', '121.0943482', '內灣線', '新竹縣竹東鎮雞林里東林路196號', '03-5962042', '新竹縣');
INSERT INTO `station` VALUES ('244', '2206', '橫山站', '24.7205632', '121.1165462', '內灣線', '新竹縣橫山鄉橫山村橫山路97號(無站房)', '無', '新竹縣');
INSERT INTO `station` VALUES ('245', '2207', '九讚頭站', '24.7206375', '121.1362146', '內灣線', '新竹縣橫山鄉中豐路2段286巷29號', '03-5962042', '新竹縣');
INSERT INTO `station` VALUES ('246', '2208', '合興站', '24.7167094', '121.1543901', '內灣線', '新竹縣橫山鄉中山街1段17號', '無', '新竹縣');
INSERT INTO `station` VALUES ('247', '2209', '富貴站', '24.715543', '121.167371', '內灣線', '新竹縣橫山鄉(無站房)', '無', '新竹縣');
INSERT INTO `station` VALUES ('248', '2210', '內灣站', '24.7053022', '121.1825562', '內灣線', '新竹縣橫山鄉中正路6號', '無', '新竹縣');
INSERT INTO `station` VALUES ('249', '2211', '榮華站', '24.748359', '121.08331', '內灣線', '新竹縣竹東鎮仁愛里(無站房)', '無', '新竹縣');
INSERT INTO `station` VALUES ('25', '1619', '玉里站', '23.3315175', '121.311726', '', '花蓮縣玉里鎮康樂街39號', '03-8882020', '花蓮縣');
INSERT INTO `station` VALUES ('251', '2702', '源泉站', '23.797054', '120.639857', '集集線', '彰化縣二水鄉合興村英義路(無站房)', '無', '彰化縣');
INSERT INTO `station` VALUES ('252', '2703', '濁水站', '23.8362337', '120.7043512', '集集線', '南投縣名間鄉濁水村車站路53號', '無', '南投縣');
INSERT INTO `station` VALUES ('253', '2704', '龍泉站', '23.833556', '120.737912', '集集線', '南投縣集集鎮隘寮村(無站房)', '無', '南投縣');
INSERT INTO `station` VALUES ('254', '2705', '集集站', '23.826451', '120.784891', '集集線', '南投縣集集鎮民生路75號', '無', '南投縣');
INSERT INTO `station` VALUES ('255', '2706', '水里站', '23.8184559', '120.853323', '集集線', '南投縣水里鄉民生路442號', '無', '南投縣');
INSERT INTO `station` VALUES ('256', '2707', '車埕站', '23.8326366', '120.8657454', '集集線', '南投縣水里鄉車埕村民權巷2號', '無', '南投縣');
INSERT INTO `station` VALUES ('261', '1030', '百福站', '25.0779244', '121.693623', '', '基隆市明德三路1-1號', '02-24528372', '基隆市');
INSERT INTO `station` VALUES ('262', '1031', '汐科站', '25.062563', '121.6466505', '', '新北市汐止區大同路2段182號', '02-23815226#873', '新北市');
INSERT INTO `station` VALUES ('264', '1032', '浮洲站', '25.0041922', '121.444737', '', '新北市板橋區僑中二街156號', '02-23815226#466', '新北市');
INSERT INTO `station` VALUES ('265', '1034', '南樹林站', '24.9804377', '121.4088524', '', '新北市樹林區中山里中山路2段230號', '02-23815226#440', '新北市');
INSERT INTO `station` VALUES ('27', '1617', '三民站', '23.424535', '121.345403', '', '花蓮縣玉里鎮三民路10號', '03-8841847', '花蓮縣');
INSERT INTO `station` VALUES ('271', '1033', '北湖站', '24.922226', '121.055736', '', '新竹縣湖口鄉東興村北湖路1號', '03-5993850', '新竹縣');
INSERT INTO `station` VALUES ('273', '1035', '三姓橋站', '24.787326', '120.928405', '', '新竹市香山區元培街32巷30號', '', '新竹市');
INSERT INTO `station` VALUES ('280', '1324', '新烏日站', '24.1100254', '120.6162073', '山', '臺中市烏日區高鐵東一路', '04-23376883', '臺中市');
INSERT INTO `station` VALUES ('281', '1243', '仁德站', '22.9215274', '120.2432267', '', '臺南市仁德區保安里永德路10號', '06-2669383', '臺南市');
INSERT INTO `station` VALUES ('282', '1244', '南科站', '23.100596', '120.307701', '', '臺南市新市區大營里大營村287-300號', '06-5896356', '臺南市');
INSERT INTO `station` VALUES ('283', '5101', '長榮大學站', '22.9099639', '120.2714247', '沙崙線', '臺南市歸仁區長榮一段200巷72弄126號', '06-2782615', '臺南市');
INSERT INTO `station` VALUES ('284', '5102', '沙崙站', '22.923848', '120.286403', '沙崙線', '臺南市歸仁區沙崙里歸仁大道102號', '', '臺南市');
INSERT INTO `station` VALUES ('288', '1242', '新左營站', '22.6875442', '120.3067878', '', '高雄市左營區尾北里站前北路1號', '07-5887825', '高雄市');
INSERT INTO `station` VALUES ('29', '1616', '瑞穗站', '23.4973759', '121.3768412', '', '花蓮縣瑞穗鄉四維街13號', '03-8875039', '花蓮縣');
INSERT INTO `station` VALUES ('291', '6103', '海科館站', '25.13838', '121.799062', '深澳線', '基隆市中正區八斗子', '無', '基隆市');
INSERT INTO `station` VALUES ('292', '2003', '八斗子站', '25.135311', '121.8028572', '深澳線', '', '', '');
INSERT INTO `station` VALUES ('31', '1614', '富源站', '23.5802685', '121.3801225', '', '花蓮縣瑞穗鄉富源路2號', '03-8811824', '花蓮縣');
INSERT INTO `station` VALUES ('32', '1613', '大富站', '23.605688', '121.3896245', '', '花蓮縣光復鄉明德路1號', '無', '花蓮縣');
INSERT INTO `station` VALUES ('34', '1612', '光復站', '23.666293', '121.4211678', '', '花蓮縣光復鄉中正路1段2-1號', '03-8704143', '花蓮縣');
INSERT INTO `station` VALUES ('35', '1611', '萬榮站', '23.711978', '121.419067', '', '花蓮縣鳳林鎮長德街17號', '03-8752175', '花蓮縣');
INSERT INTO `station` VALUES ('36', '1610', '鳳林站', '23.74634', '121.4470243', '', '花蓮縣鳳林鎮中山路43號', '03-8762004', '花蓮縣');
INSERT INTO `station` VALUES ('37', '1609', '南平站', '23.7822757', '121.4582804', '', '花蓮縣鳳林鎮自強路233號', '03-8771597', '花蓮縣');
INSERT INTO `station` VALUES ('4', '1632', '臺東站', '22.7946607', '121.1234431', '', '臺東縣臺東市岩灣路101巷598號', '089-229687', '臺東縣');
INSERT INTO `station` VALUES ('40', '1607', '豐田站', '23.848475', '121.496168', '', '花蓮縣壽豐鄉站前街36號', '03-8654251', '花蓮縣');
INSERT INTO `station` VALUES ('41', '1606', '壽豐站', '23.869016', '121.510633', '', '花蓮縣壽豐鄉壽山路1號', '03-8653706', '花蓮縣');
INSERT INTO `station` VALUES ('42', '1605', '平和站', '23.8827741', '121.520485', '', '花蓮縣壽豐鄉平和路1號', '無', '花蓮縣');
INSERT INTO `station` VALUES ('43', '1604', '志學站', '23.9074936', '121.5294366', '', '花蓮縣壽豐鄉中正路1號', '03-8662966', '花蓮縣');
INSERT INTO `station` VALUES ('45', '1602', '吉安站', '23.9667376', '121.5853166', '', '花蓮縣吉安鄉南昌街200號', '03-8539423', '花蓮縣');
INSERT INTO `station` VALUES ('51', '1715', '花蓮站', '23.9928678', '121.6009927', '', '花蓮縣花蓮市國聯一路100號', '03-8355941', '花蓮縣');
INSERT INTO `station` VALUES ('52', '1714', '北埔站', '24.0259577', '121.6028403', '', '花蓮縣新城鄉自強街113號', '03-8263809', '花蓮縣');
INSERT INTO `station` VALUES ('53', '1713', '景美站', '24.090317', '121.610786', '', '花蓮縣秀林鄉加灣178-1號', '無', '花蓮縣');
INSERT INTO `station` VALUES ('54', '1712', '新城站', '24.1275238', '121.640866', '', '花蓮縣新城鄉新城村新興1路73號', '03-8611237', '花蓮縣');
INSERT INTO `station` VALUES ('55', '1711', '崇德站', '24.1693952', '121.6543068', '', '花蓮縣秀林鄉海濱路96號', '03-8621365', '花蓮縣');
INSERT INTO `station` VALUES ('56', '1710', '和仁站', '24.2481897', '121.7294026', '', '花蓮縣秀林鄉和仁路71號', '03-8681221', '花蓮縣');
INSERT INTO `station` VALUES ('57', '1709', '和平站', '24.2982959', '121.7533456', '', '花蓮縣秀林鄉和平村276號', '03-8681009', '花蓮縣');
INSERT INTO `station` VALUES ('58', '1708', '漢本站', '24.3354282', '121.7683548', '', '宜蘭縣南澳鄉澳花村蘇花路1段56號', '03-9985238', '宜蘭縣');
INSERT INTO `station` VALUES ('6', '1631', '山里站', '22.862046', '121.138031', '', '臺東縣卑南鄉山里路108號', '089-572370', '臺東縣');
INSERT INTO `station` VALUES ('60', '1706', '武塔站', '24.4486736', '121.7760368', '', '宜蘭縣南澳鄉武塔村新溪路18號', '無', '宜蘭縣');
INSERT INTO `station` VALUES ('62', '1705', '南澳站', '24.4633961', '121.8009262', '', '宜蘭縣蘇澳鎮南強里大通路22號', '03-9981971', '宜蘭縣');
INSERT INTO `station` VALUES ('63', '1704', '東澳站', '24.518281', '121.830705', '', '宜蘭縣南澳鄉東岳村1號', '03-9986053', '宜蘭縣');
INSERT INTO `station` VALUES ('64', '1703', '永樂站', '24.5684172', '121.8445641', '', '宜蘭縣蘇澳鎮永樂里圳頭路60號', '03-9961889', '宜蘭縣');
INSERT INTO `station` VALUES ('66', '1827', '蘇澳站', '24.5951807', '121.8514401', '', '宜蘭縣蘇澳鎮蘇南里太平路1號', '03-9962028', '宜蘭縣');
INSERT INTO `station` VALUES ('67', '1826', '蘇澳新站', '24.6090239', '121.82703', '', '宜蘭縣蘇澳鎮中山路2段238號之1', '03-9961004', '宜蘭縣');
INSERT INTO `station` VALUES ('68', '1825', '新馬站', '24.6153953', '121.8229', '', '宜蘭縣蘇澳鎮中山路2段322號', '無', '宜蘭縣');
INSERT INTO `station` VALUES ('69', '1824', '冬山站', '24.6362965', '121.7921071', '', '宜蘭縣冬山鄉冬山村中正路1號', '03-9594221', '宜蘭縣');
INSERT INTO `station` VALUES ('70', '1823', '羅東站', '24.6779285', '121.7746293', '', '宜蘭縣羅東鎮大新里公正路2號', '03-9542117', '宜蘭縣');
INSERT INTO `station` VALUES ('71', '1822', '中里站', '24.694166', '121.775256', '', '宜蘭縣五結鄉台興路10號', '無', '宜蘭縣');
INSERT INTO `station` VALUES ('72', '1821', '二結站', '24.7052671', '121.774131', '', '宜蘭縣五結鄉三興村復興中路37號', '03-9650304', '宜蘭縣');
INSERT INTO `station` VALUES ('73', '1820', '宜蘭站', '24.7545124', '121.7582529', '', '宜蘭縣宜蘭市和睦里光復路1號', '03-9323801', '宜蘭縣');
INSERT INTO `station` VALUES ('74', '1819', '四城站', '24.7868018', '121.7627275', '', '宜蘭縣礁溪鄉吳沙村站前路24號', '03-9282449', '宜蘭縣');
INSERT INTO `station` VALUES ('75', '1818', '礁溪站', '24.8270345', '121.7753536', '', '宜蘭縣礁溪鄉德陽村溫泉路1號', '03-9886940', '宜蘭縣');
INSERT INTO `station` VALUES ('76', '1817', '頂埔站', '24.843998', '121.8092075', '', '宜蘭縣頭城鎮下埔里下埔路4-8號', '無', '宜蘭縣');
INSERT INTO `station` VALUES ('77', '1816', '頭城站', '24.8589758', '121.8225558', '', '宜蘭縣頭城鎮城北里纘祥路59號', '03-9771429', '宜蘭縣');
INSERT INTO `station` VALUES ('78', '1815', '外澳站', '24.8837032', '121.8457576', '', '宜蘭縣頭城鎮外澳里濱海路2段217號', '無', '宜蘭縣');
INSERT INTO `station` VALUES ('79', '1814', '龜山站', '24.9048183', '121.8688782', '', '宜蘭縣頭城鎮更新里濱海路3段261號', '03-9770351', '宜蘭縣');
INSERT INTO `station` VALUES ('8', '1630', '鹿野站', '22.9124694', '121.1370039', '', '臺東縣鹿野鄉中正路38號', '089-550217', '臺東縣');
INSERT INTO `station` VALUES ('80', '1813', '大溪站', '24.9384235', '121.8898732', '', '宜蘭縣頭城鎮大溪里濱海路5段63號', '無', '宜蘭縣');
INSERT INTO `station` VALUES ('81', '1812', '大里站', '24.9667986', '121.9224961', '', '宜蘭縣頭城鎮大里里濱海路6段326號', '03-9781171', '宜蘭縣');
INSERT INTO `station` VALUES ('82', '1811', '石城站', '24.9783344', '121.9451914', '', '宜蘭縣頭城鎮石城里濱海路7段230號', '無', '宜蘭縣');
INSERT INTO `station` VALUES ('83', '1810', '福隆站', '25.0163397', '121.9448946', '', '新北市貢寮區福隆里福隆街2號', '02-24991800', '新北市');
INSERT INTO `station` VALUES ('84', '1809', '貢寮站', '25.0219664', '121.9093995', '', '新北市貢寮區貢寮里朝陽街33號', '02-24941500', '新北市');
INSERT INTO `station` VALUES ('85', '1808', '雙溪站', '25.0386122', '121.8658396', '', '新北市雙溪區新基里朝陽街1號', '02-24932980', '新北市');
INSERT INTO `station` VALUES ('86', '1807', '牡丹站', '25.058768', '121.851999', '', '新北市雙溪區牡丹路159號', '無', '新北市');
INSERT INTO `station` VALUES ('87', '1806', '三貂嶺站', '25.0655443', '121.8225588', '', '新北市瑞芳區碩仁里魚寮路1號', '02-24977896', '新北市');
INSERT INTO `station` VALUES ('88', '1805', '猴硐站', '25.0870094', '121.8274239', '', '新北市瑞芳區光復里柴寮路70號', '02-24977747', '新北市');
INSERT INTO `station` VALUES ('89', '1804', '瑞芳站', '25.1089277', '121.8061486', '', '新北市瑞芳區龍潭里明燈路3段82號', '02-24972033', '新北市');
INSERT INTO `station` VALUES ('9', '1629', '瑞源站', '22.953923', '121.15807', '', '臺東縣鹿野鄉瑞景路1段336巷8號之1', '089-580159', '臺東縣');
INSERT INTO `station` VALUES ('90', '1803', '四腳亭站', '25.1027508', '121.7618869', '', '新北市瑞芳區吉慶里中央路65號', '02-24579346', '新北市');
INSERT INTO `station` VALUES ('91', '1802', '暖暖站', '25.1022821', '121.740329', '', '基隆市暖暖街51號', '無', '基隆市');
INSERT INTO `station` VALUES ('92', '1001', '基隆站', '25.1323018', '121.7394664', '', '基隆市仁愛區文昌里港西街5號', '02-24263743', '基隆市');
INSERT INTO `station` VALUES ('93', '1002', '八堵站', '25.1083342', '121.7290544', '', '基隆市暖暖區八南里八堵路142號', '02-24560841', '基隆市');
INSERT INTO `station` VALUES ('94', '1003', '七堵站', '25.0934531', '121.713928', '', '基隆市七堵區長興里東新街2號之1', '02-24553426', '基隆市');
INSERT INTO `station` VALUES ('95', '1004', '五堵站', '25.077857', '121.66763', '', '新北市汐止區長安里長安路17號', '02-86476200', '新北市');
INSERT INTO `station` VALUES ('96', '1005', '汐止站', '25.068316', '121.6617346', '', '新北市汐止區信望里信義路1號', '02-26415096', '新北市');
INSERT INTO `station` VALUES ('97', '1006', '南港站', '25.053216', '121.6070578', '', '臺北市南港區南港路1段313號', '02-27838645', '臺北市');
INSERT INTO `station` VALUES ('98', '1007', '松山站', '25.0491921', '121.5779143', '', '臺北市信義區永吉里松山路11號', '02-27673819', '臺北市');
COMMIT;

SET FOREIGN_KEY_CHECKS = 1;
