/*
 Navicat Premium Data Transfer

 Source Server         : localhost
 Source Server Type    : MySQL
 Source Server Version : 100122
 Source Host           : localhost:3306
 Source Schema         : 1062XML

 Target Server Type    : MySQL
 Target Server Version : 100122
 File Encoding         : 65001

 Date: 19/06/2018 11:26:45
*/

SET NAMES utf8mb4;
SET FOREIGN_KEY_CHECKS = 0;

-- ----------------------------
-- Table structure for tour
-- ----------------------------
DROP TABLE IF EXISTS `tour`;
CREATE TABLE `tour` (
  `tid` int(11) NOT NULL AUTO_INCREMENT,
  `TrainNo` varchar(5) NOT NULL,
  `StationID` varchar(5) NOT NULL,
  `StationName` varchar(5) NOT NULL,
  `ArrivalTime` varchar(5) NOT NULL,
  `DepartureTime` varchar(5) NOT NULL,
  `day` int(11) NOT NULL,
  `TourName` varchar(30) NOT NULL,
  `tourdate` varchar(20) NOT NULL,
  `tourstartdate` varchar(20) NOT NULL,
  `tourenddate` varchar(20) NOT NULL,
  PRIMARY KEY (`tid`)
) ENGINE=MyISAM AUTO_INCREMENT=28 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of tour
-- ----------------------------
BEGIN;
INSERT INTO `tour` VALUES (1, '5801', '098', '松山站', '', '06:53', 3, '仲夏寶島號、旗美客家庄、漫步太麻里3天', '2018/06/22', '2018/06/22', '2018/06/24');
INSERT INTO `tour` VALUES (2, '5801', '100', '臺北站', '07:00', '07:03', 3, '仲夏寶島號、旗美客家庄、漫步太麻里3天', '2018/06/22', '2018/06/22', '2018/06/24');
INSERT INTO `tour` VALUES (3, '5801', '102', '板橋站', '07:12', '07:13', 3, '仲夏寶島號、旗美客家庄、漫步太麻里3天', '2018/06/22', '2018/06/22', '2018/06/24');
INSERT INTO `tour` VALUES (4, '5801', '103', '樹林站', '07:20', '07:21', 3, '仲夏寶島號、旗美客家庄、漫步太麻里3天', '2018/06/22', '2018/06/22', '2018/06/24');
INSERT INTO `tour` VALUES (5, '5801', '106', '桃園站', '07:38', '07:40', 3, '仲夏寶島號、旗美客家庄、漫步太麻里3天', '2018/06/22', '2018/06/22', '2018/06/24');
INSERT INTO `tour` VALUES (6, '5801', '108', '中壢站', '07:50', '07:52', 3, '仲夏寶島號、旗美客家庄、漫步太麻里3天', '2018/06/22', '2018/06/22', '2018/06/24');
INSERT INTO `tour` VALUES (7, '5801', '115', '新竹站', '08:26', '08:28', 3, '仲夏寶島號、旗美客家庄、漫步太麻里3天', '2018/06/22', '2018/06/22', '2018/06/24');
INSERT INTO `tour` VALUES (8, '5801', '124', '新埔站', '09:30', '10:30', 3, '仲夏寶島號、旗美客家庄、漫步太麻里3天', '2018/06/22', '2018/06/22', '2018/06/24');
INSERT INTO `tour` VALUES (9, '5801', '169', '林鳳營站', '12:54', '13:25', 3, '仲夏寶島號、旗美客家庄、漫步太麻里3天', '2018/06/22', '2018/06/22', '2018/06/24');
INSERT INTO `tour` VALUES (10, '5801', '180', '岡山站', '14:12', '14:15', 3, '仲夏寶島號、旗美客家庄、漫步太麻里3天', '2018/06/22', '2018/06/22', '2018/06/24');
INSERT INTO `tour` VALUES (11, '5801', '185', '高雄站', '', '09:40', 3, '仲夏寶島號、旗美客家庄、漫步太麻里3天', '2018/06/23', '2018/06/22', '2018/06/24');
INSERT INTO `tour` VALUES (12, '5801', '195', '潮州站', '10:25', '12:08', 3, '仲夏寶島號、旗美客家庄、漫步太麻里3天', '2018/06/23', '2018/06/22', '2018/06/24');
INSERT INTO `tour` VALUES (13, '5801', '217', '太麻里站', '14:33', '14:45', 3, '仲夏寶島號、旗美客家庄、漫步太麻里3天', '2018/06/23', '2018/06/22', '2018/06/24');
INSERT INTO `tour` VALUES (14, '5801', '004', '臺東站', '', '09:00', 3, '仲夏寶島號、旗美客家庄、漫步太麻里3天', '2018/06/24', '2018/06/22', '2018/06/24');
INSERT INTO `tour` VALUES (15, '5801', '006', '山里站', '09:17', '10:02', 3, '仲夏寶島號、旗美客家庄、漫步太麻里3天', '2018/06/24', '2018/06/22', '2018/06/24');
INSERT INTO `tour` VALUES (16, '5801', '012', '關山站', '10:43', '11:03', 3, '仲夏寶島號、旗美客家庄、漫步太麻里3天', '2018/06/24', '2018/06/22', '2018/06/24');
INSERT INTO `tour` VALUES (17, '5801', '015', '池上站', '11:30', '12:47', 3, '仲夏寶島號、旗美客家庄、漫步太麻里3天', '2018/06/24', '2018/06/22', '2018/06/24');
INSERT INTO `tour` VALUES (18, '5801', '018', '富里站', '13:00', '13:40', 3, '仲夏寶島號、旗美客家庄、漫步太麻里3天', '2018/06/24', '2018/06/22', '2018/06/24');
INSERT INTO `tour` VALUES (19, '5801', '025', '玉里站', '14:37', '14:47', 3, '仲夏寶島號、旗美客家庄、漫步太麻里3天', '2018/06/24', '2018/06/22', '2018/06/24');
INSERT INTO `tour` VALUES (20, '5801', '054', '新城站', '16:32', '18:12', 3, '仲夏寶島號、旗美客家庄、漫步太麻里3天', '2018/06/24', '2018/06/22', '2018/06/24');
INSERT INTO `tour` VALUES (21, '5801', '098', '松山站', '20:46', '20:53', 3, '仲夏寶島號、旗美客家庄、漫步太麻里3天', '2018/06/24', '2018/06/22', '2018/06/24');
INSERT INTO `tour` VALUES (22, '5801', '100', '臺北站', '21:00', '21:03', 3, '仲夏寶島號、旗美客家庄、漫步太麻里3天', '2018/06/24', '2018/06/22', '2018/06/24');
INSERT INTO `tour` VALUES (23, '5801', '102', '板橋站', '21:12', '21:13', 3, '仲夏寶島號、旗美客家庄、漫步太麻里3天', '2018/06/24', '2018/06/22', '2018/06/24');
INSERT INTO `tour` VALUES (24, '5801', '103', '樹林站', '21:20', '21:21', 3, '仲夏寶島號、旗美客家庄、漫步太麻里3天', '2018/06/24', '2018/06/22', '2018/06/24');
INSERT INTO `tour` VALUES (25, '5801', '106', '桃園站', '21:40', '21:41', 3, '仲夏寶島號、旗美客家庄、漫步太麻里3天', '2018/06/24', '2018/06/22', '2018/06/24');
INSERT INTO `tour` VALUES (26, '5801', '108', '中壢站', '21:51', '21:52', 3, '仲夏寶島號、旗美客家庄、漫步太麻里3天', '2018/06/24', '2018/06/22', '2018/06/24');
INSERT INTO `tour` VALUES (27, '5801', '115', '新竹站', '22:26', '', 3, '仲夏寶島號、旗美客家庄、漫步太麻里3天', '2018/06/24', '2018/06/22', '2018/06/24');
COMMIT;

SET FOREIGN_KEY_CHECKS = 1;
